In [2]:
import pandas as pd
import numpy.random as rand
import numpy as np

In [3]:
test_df = pd.DataFrame(rand.randn(4,5), columns=['a','b','c','d','e'])
test_df

          a         b         c         d         e
0 -1.269977 -1.177370  1.158399 -0.016085  0.203176
1 -0.519371 -0.260523 -0.215049 -0.487501  1.459452
2  0.428743  0.699861 -0.112447  0.096921 -0.798860
3 -2.234911 -0.776609 -0.083039  0.412606 -0.847500

In [89]:
test_df.columns

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

How to create new columns derived from existing columns in Pandas?

In [90]:
test_df.loc[:, 'f'] = test_df.loc[:, 'a'].values + test_df.loc[:, 'e'].values
test_df

          a         b         c         d         e         f
0 -0.898224 -1.221238  0.972089  1.408249  0.305752 -0.592472
1  0.326077 -0.664637 -1.171334  0.581604 -0.095679  0.230398
2  1.263796  0.225799  0.359943 -0.235585 -1.416931 -0.153135
3  0.996124  0.641902 -0.937678 -0.968739  0.235575  1.231699

A column in a df has boolean True/False values, but for further calculations, we need 1/0 representation. How would you transform it?

In [91]:
test_df['bool'] = test_df['b'].values > 0
test_df

          a         b         c         d         e         f   bool
0 -0.898224 -1.221238  0.972089  1.408249  0.305752 -0.592472  False
1  0.326077 -0.664637 -1.171334  0.581604 -0.095679  0.230398  False
2  1.263796  0.225799  0.359943 -0.235585 -1.416931 -0.153135   True
3  0.996124  0.641902 -0.937678 -0.968739  0.235575  1.231699   True

In [92]:
test_df.loc[:, 'bool'] = test_df['bool'].astype('int')

Describe how you will get the names of columns of a DataFrame in Pandas

In [93]:
[el for el in test_df.columns]

['a', 'b', 'c', 'd', 'e', 'f', 'bool']

In [94]:
sorted(test_df.columns)

['a', 'b', 'bool', 'c', 'd', 'e', 'f']

How are `iloc()` and `loc()` different?

In [79]:
# returns rows and cols by number
test_df.iloc[1:3,0:2]

# returns values by col name and row index
test_df.loc[:2, ['a', 'e']]

          a         e
0  0.817888 -0.985605
1 -1.201152 -0.205126
2  2.479945 -0.360293

 How can you sort the DataFrame?

In [97]:
test_df.sort_values(['a', 'b'])

          a         b         c         d         e         f  bool
0 -0.898224 -1.221238  0.972089  1.408249  0.305752 -0.592472     0
1  0.326077 -0.664637 -1.171334  0.581604 -0.095679  0.230398     0
3  0.996124  0.641902 -0.937678 -0.968739  0.235575  1.231699     1
2  1.263796  0.225799  0.359943 -0.235585 -1.416931 -0.153135     1

How can you find the row for which the value of a specific column is max or min?

In [101]:
test_df[test_df['a'] == test_df['a'].max()].index[0]

2

In [102]:
test_df['a'].idxmax()

2

How can you get a list of Pandas DataFrame columns based on data type?

In [108]:
test_df.dtypes[test_df.dtypes == 'int64'].index

Index(['bool'], dtype='object')

In [111]:
sorted(test_df.select_dtypes(['float64']))

['a', 'b', 'c', 'd', 'e', 'f']

How does the groupby() method works in Pandas?

In [115]:
test_df.groupby('bool')['a'].mean()

# SPLIT df into subgroups of rows 
# APPLY function to each subgroup 
# COMBINE the result by the values of the col the df is grouped by

bool
0   -0.286074
1    1.129960
Name: a, dtype: float64

How to split a string column in a DataFrame into two columns?

In [30]:
test_df['str_col'] = np.array('f d  s d  w e  l k'.split('  ')).reshape(-1,1)

In [28]:
test_df

          a         b         c         d         e str_col
0 -1.269977 -1.177370  1.158399 -0.016085  0.203176     f d
1 -0.519371 -0.260523 -0.215049 -0.487501  1.459452     s d
2  0.428743  0.699861 -0.112447  0.096921 -0.798860     w e
3 -2.234911 -0.776609 -0.083039  0.412606 -0.847500      lk

In [18]:
test_df['str_col_2'] = test_df['str_col'].apply(lambda x: x[1])
test_df['str_col'] = test_df['str_col'].apply(lambda x: x[0])

In [22]:
del test_df['str_col_2']

In [32]:
test_df['str_col'].str.split(expand=True)

   0  1
0  f  d
1  s  d
2  w  e
3  l  k

How to check whether a Pandas DataFrame is empty?

In [34]:
empt_df = pd.DataFrame(None)

In [44]:
empt_df.empty

True

How would you iterate over rows in a DataFrame in Pandas?

In [45]:
test_df

          a         b         c         d         e str_col
0 -1.269977 -1.177370  1.158399 -0.016085  0.203176     f d
1 -0.519371 -0.260523 -0.215049 -0.487501  1.459452     s d
2  0.428743  0.699861 -0.112447  0.096921 -0.798860     w e
3 -2.234911 -0.776609 -0.083039  0.412606 -0.847500     l k

In [58]:
for n, el in test_df.iterrows():
    print(el['a'], el['str_col'])

-1.2699773996930952 f d
-0.5193712753001253 s d
0.4287425536418248 w e
-2.234911469783308 l k

What are the operations that Pandas Groupby method is based on ?

In [ ]:
Split Apply Group

What does describe() percentiles values tell about our data?

In [59]:
test_df.describe()

              a         b         c         d         e
count  4.000000  4.000000  4.000000  4.000000  4.000000
mean  -0.898879 -0.378661  0.186966  0.001485  0.004067
std    1.129794  0.811062  0.650090  0.373070  1.084381
min   -2.234911 -1.177370 -0.215049 -0.487501 -0.847500
25%   -1.511211 -0.876800 -0.138097 -0.133939 -0.811020
50%   -0.894674 -0.518566 -0.097743  0.040418 -0.297842
75%   -0.282343 -0.020427  0.227321  0.175842  0.517245
max    0.428743  0.699861  1.158399  0.412606  1.459452

 Compare the Pandas methods: map(), applymap(), apply()

In [61]:
# replaces values in the column, returnes NaN for values that ar enot in the mapping
test_df.str_col.map({'f d':'val1', 'w e':'val2'})

0    val1
1     NaN
2    val2
3     NaN
Name: str_col, dtype: object

In [64]:
# applies a function to a value from the column selected
test_df.a.apply(lambda x: x+1)

0   -0.269977
1    0.480629
2    1.428743
3   -1.234911
Name: a, dtype: float64

In [66]:
# applies a function to a value from the all columns row by row elementwise
test_df[['a','b','c']].applymap(lambda x: x+1)

          a         b         c
0 -0.269977 -0.177370  2.158399
1  0.480629  0.739477  0.784951
2  1.428743  1.699861  0.887553
3 -1.234911  0.223391  0.916961

Describe how you can combine (merge) data on Common Columns or Indices?

In [215]:
pd.DataFrame([[1,2,3], [1,2,3]])

   0  1  2
0  1  2  3
1  1  2  3

In [70]:
df_to_merge = pd.DataFrame(rand.randn(10,3), columns=['m1','m2','m3'])
df_to_merge

         m1        m2        m3
0  0.303826 -1.916549  0.629954
1  1.448148 -1.350026  0.965585
2  0.910323 -0.421423  0.103911
3 -0.484875 -0.436535 -0.881022
4  0.708399 -1.977286 -0.504605
5  0.416926  0.409516 -1.226937
6 -0.809526  0.529010  0.690958
7 -1.067186  0.359408  1.167650
8  1.481487  1.065856  0.468982
9  0.236708 -0.468079  2.557090

In [78]:
# apart from corresponding rows, only rows that do no match from the left df are preserved
test_df.merge(df_to_merge, how='left', left_index=True, right_index=True)

,a,b,c,d,e,str_col,m1,m2,m3
0,-1.269977,-1.177370,1.158399,-0.016085,0.203176,f d,0.303826,-1.916549,0.629954
1,-0.519371,-0.260523,-0.215049,-0.487501,1.459452,s d,1.448148,-1.350026,0.965585
2,0.428743,0.699861,-0.112447,0.096921,-0.798860,w e,0.910323,-0.421423,0.103911
3,-2.234911,-0.776609,-0.083039,0.412606,-0.847500,l k,-0.484875,-0.436535,-0.881022

In [79]:
# apart from corresponding rows, only rows that do no match from the right df are preserved
test_df.merge(df_to_merge, how='right', left_index=True, right_index=True)

,a,b,c,d,e,str_col,m1,m2,m3
0,-1.269977,-1.177370,1.158399,-0.016085,0.203176,f d,0.303826,-1.916549,0.629954
1,-0.519371,-0.260523,-0.215049,-0.487501,1.459452,s d,1.448148,-1.350026,0.965585
2,0.428743,0.699861,-0.112447,0.096921,-0.798860,w e,0.910323,-0.421423,0.103911
3,-2.234911,-0.776609,-0.083039,0.412606,-0.847500,l k,-0.484875,-0.436535,-0.881022
4,NaN,NaN,NaN,NaN,NaN,NaN,0.708399,-1.977286,-0.504605
5,NaN,NaN,NaN,NaN,NaN,NaN,0.416926,0.409516,-1.226937
6,NaN,NaN,NaN,NaN,NaN,NaN,-0.809526,0.529010,0.690958
7,NaN,NaN,NaN,NaN,NaN,NaN,-1.067186,0.359408,1.167650
8,NaN,NaN,NaN,NaN,NaN,NaN,1.481487,1.065856,0.468982
9,NaN,NaN,NaN,NaN,NaN,NaN,0.236708,-0.468079,2.557090

In [80]:
# only corresponding rows are preserved from left and right
test_df.merge(df_to_merge, how='inner', left_index=True, right_index=True)

,a,b,c,d,e,str_col,m1,m2,m3
0,-1.269977,-1.177370,1.158399,-0.016085,0.203176,f d,0.303826,-1.916549,0.629954
1,-0.519371,-0.260523,-0.215049,-0.487501,1.459452,s d,1.448148,-1.350026,0.965585
2,0.428743,0.699861,-0.112447,0.096921,-0.798860,w e,0.910323,-0.421423,0.103911
3,-2.234911,-0.776609,-0.083039,0.412606,-0.847500,l k,-0.484875,-0.436535,-0.881022

In [81]:
#both left and right rows are preserved, coresponding rows are mtached by index
test_df.merge(df_to_merge, how='outer', left_index=True, right_index=True)

,a,b,c,d,e,str_col,m1,m2,m3
0,-1.269977,-1.177370,1.158399,-0.016085,0.203176,f d,0.303826,-1.916549,0.629954
1,-0.519371,-0.260523,-0.215049,-0.487501,1.459452,s d,1.448148,-1.350026,0.965585
2,0.428743,0.699861,-0.112447,0.096921,-0.798860,w e,0.910323,-0.421423,0.103911
3,-2.234911,-0.776609,-0.083039,0.412606,-0.847500,l k,-0.484875,-0.436535,-0.881022
4,NaN,NaN,NaN,NaN,NaN,NaN,0.708399,-1.977286,-0.504605
5,NaN,NaN,NaN,NaN,NaN,NaN,0.416926,0.409516,-1.226937
6,NaN,NaN,NaN,NaN,NaN,NaN,-0.809526,0.529010,0.690958
7,NaN,NaN,NaN,NaN,NaN,NaN,-1.067186,0.359408,1.167650
8,NaN,NaN,NaN,NaN,NaN,NaN,1.481487,1.065856,0.468982
9,NaN,NaN,NaN,NaN,NaN,NaN,0.236708,-0.468079,2.557090

Find a way to binary encode multi-valued categorical variables from a Pandas dataframe

In [83]:
test_df['cat'] = ['a', 'b', 'a', 'c']

In [90]:
test_df.merge(pd.get_dummies(test_df['cat'], prefix='cat'), left_index=True, right_index=True)

,a,b,c,d,e,str_col,cat,cat_a,cat_b,cat_c
0,-1.269977,-1.177370,1.158399,-0.016085,0.203176,f d,a,1,0,0
1,-0.519371,-0.260523,-0.215049,-0.487501,1.459452,s d,b,0,1,0
2,0.428743,0.699861,-0.112447,0.096921,-0.798860,w e,a,1,0,0
3,-2.234911,-0.776609,-0.083039,0.412606,-0.847500,l k,c,0,0,1

In [92]:
tst = pd.DataFrame.from_records(
    [[0, 'A'], [0, 'B'], [1, 'B'], [1, 'C'], [1, 'D'], [2, 'B'], [2, 'D']],
    columns=['number_label', 'category'])

In [121]:
tst

   number_label category
0             0        A
1             0        B
2             1        B
3             1        C
4             1        D
5             2        B
6             2        D

In [120]:
pd.get_dummies(tst['category'])

   A  B  C  D
0  1  0  0  0
1  0  1  0  0
2  0  1  0  0
3  0  0  1  0
4  0  0  0  1
5  0  1  0  0
6  0  0  0  1

In [117]:
tst.pivot_table(columns='category', index='number_label', aggfunc='size', fill_value=0)

category      A  B  C  D
number_label
0             1  1  0  0
1             0  1  1  1
2             0  1  0  1

In [112]:
tst.pivot_table(columns='category', index='number_label', aggfunc='size', fill_value=0)

category      A  B  C  D
number_label
0             1  1  0  0
1             0  1  1  1
2             0  1  0  1

In [118]:
test_df[['cat', 'a', 
         'b',   'c']].pivot_table(columns='cat', aggfunc='size')

cat
a    2
b    1
c    1
dtype: int64

In [123]:
df = pd.DataFrame({'Account_number':[1,1,2,2,2,3,3],
                   'Product':['A', 'A', 'A', 'B', 'B','A', 'B']
                  })
df

   Account_number Product
0               1       A
1               1       A
2               2       A
3               2       B
4               2       B
5               3       A
6               3       B

In [125]:
df.pivot_table(index='Account_number', columns='Product', aggfunc='size', fill_value=0)

Product         A  B
Account_number
1               2  0
2               1  2
3               1  1

Group DataFrame Rows into a List

In [127]:
df = pd.DataFrame( {'a':['A','A','B','B','B','C'], 'b':[1,2,5,5,4,6]})
df

   a  b
0  A  1
1  A  2
2  B  5
3  B  5
4  B  4
5  C  6

In [131]:
df.groupby('a')['b'].apply(list).reset_index(name='new')

   a        new
0  A     [1, 2]
1  B  [5, 5, 4]
2  C        [6]

How can I achieve the equivalents of SQL's IN and NOT IN in Pandas?

In [133]:
test_df[test_df['cat'].isin(['a'])]

          a         b         c         d         e str_col cat
0 -1.269977 -1.177370  1.158399 -0.016085  0.203176     f d   a
2  0.428743  0.699861 -0.112447  0.096921 -0.798860     w e   a

In [134]:
test_df[~test_df['cat'].isin(['a'])]

          a         b         c         d         e str_col cat
1 -0.519371 -0.260523 -0.215049 -0.487501  1.459452     s d   b
3 -2.234911 -0.776609 -0.083039  0.412606 -0.847500     l k   c

In [143]:
cat_vals = ['a', 'c']
test_df.query('cat in @cat_vals')

          a         b         c         d         e str_col cat
0 -1.269977 -1.177370  1.158399 -0.016085  0.203176     f d   a
2  0.428743  0.699861 -0.112447  0.096921 -0.798860     w e   a
3 -2.234911 -0.776609 -0.083039  0.412606 -0.847500     l k   c

How would you convert continuous values into discrete values in Pandas?

In [158]:
b_cat = pd.cut(test_df['b'], 3, labels=['small', 'mid', 'large'])

In [159]:
b_cat

0    small
1      mid
2    large
3    small
Name: b, dtype: category
Categories (3, object): ['small' < 'mid' < 'large']

In [162]:
test_df.insert(2, 'b_cat', b_cat)

How would you create Test (20%) and Train (80%) Datasets with Pandas?

In [170]:
from sklearn.model_selection import train_test_split

In [171]:
test_df.shape

(4, 8)

In [176]:
test, train = train_test_split(test_df, test_size=.2)

In [178]:
test

          a         b  b_cat         c         d         e str_col cat
2  0.428743  0.699861  large -0.112447  0.096921 -0.798860     w e   a
3 -2.234911 -0.776609  small -0.083039  0.412606 -0.847500     l k   c
0 -1.269977 -1.177370  small  1.158399 -0.016085  0.203176     f d   a

Pivot Table Challenge

In [180]:
df = pd.DataFrame({"Col X": ['class 1', 'class 2', 'class 3', 'class 2'],
                   "Col Y": ['cat 1', 'cat 1', 'cat 2', 'cat 3']})
df

     Col X  Col Y
0  class 1  cat 1
1  class 2  cat 1
2  class 3  cat 2
3  class 2  cat 3

In [182]:
df.pivot_table(index='Col X', columns='Col Y', aggfunc='size', fill_value=0)

Col Y    cat 1  cat 2  cat 3
Col X
class 1      1      0      0
class 2      1      0      1
class 3      0      1      0

What's the difference between at and iat in Pandas?

In [189]:
# call single value by labels
test_df.at[3,'b']

-0.7766094574500988

In [190]:
# call single value by indices
test_df.iat[3,3]

-0.08303863587609807

Suppose df2 is a subset of df1. How can you get the rows of df1 which are not in df2?

In [195]:
test_df_1 = test_df.copy()

In [197]:
test_df_2 = test_df_1[:3]

In [210]:
test_df_1[~test_df_1.index.isin(test_df_2.index)]

          a         b  b_cat         c         d       e str_col cat
3 -2.234911 -0.776609  small -0.083039  0.412606 -0.8475     l k   c

In [212]:
test_df_1[~test_df_1.isin(test_df_2)].dropna()

          a         b  b_cat         c         d       e str_col cat
3 -2.234911 -0.776609  small -0.083039  0.412606 -0.8475     l k   c

How do you construct a MultiIndex for a DataFrame? Provide an example

In [214]:
test_df.set_index(['b_cat', 'cat'])

                  a         b         c         d         e str_col
b_cat cat
small a   -1.269977 -1.177370  1.158399 -0.016085  0.203176     f d
mid   b   -0.519371 -0.260523 -0.215049 -0.487501  1.459452     s d
large a    0.428743  0.699861 -0.112447  0.096921 -0.798860     w e
small c   -2.234911 -0.776609 -0.083039  0.412606 -0.847500     l k